Repository: DanielGregatto/cqrs-api-master
Catalog: src/Domain/Resources/Messages.*.resx
Languages: pt_br

# OperationSuccessful
source: Operation completed successfully
pt_br: Operação realizada com sucesso

# SavedSuccessfully
source: Data saved successfully
pt_br: Dados salvos com sucesso

# CreatedSuccessfully
source: Record created successfully
pt_br: Registro criado com sucesso

# UpdatedSuccessfully
source: Record updated successfully
pt_br: Registro atualizado com sucesso

# DeletedSuccessfully
source: Record deleted successfully
pt_br: Registro excluído com sucesso

# NotFound
source: Record not found
pt_br: Registro não encontrado

source: Invalid operation
pt_br: Operação inválida

# UnexpectedError
source: An unexpected error occurred
pt_br: Ocorreu um erro inesperado

# DatabaseError
source: Database error occurred
pt_br: Erro ao acessar o banco de dados

source: Unauthorized access
pt_br: Acesso não autorizado

# ForbiddenAccess
source: You don't have permission to access this resource
pt_br: Você não tem permissão para acessar este recurso

# RequiredField
source: {0} is required
pt_br: O campo {0} é obrigatório

# InvalidEmail
source: Invalid email address
pt_br: Endereço de email inválido

# InvalidFormat
source: Invalid format for {0}
pt_br: Formato inválido para {0}

# MinLength
source: {0} must be at least {1} characters
pt_br: {0} deve ter no mínimo {1} caracteres

# MaxLength
source: {0} cannot exceed {1} characters
pt_br: {0} não pode exceder {1} caracteres

# DuplicateEntry
source: A record with this {0} already exists
pt_br: Já existe um registro com este {0}

# InvalidValue
source: Invalid value for {0}
pt_br: Valor inválido para {0}

# MustBeGreaterThan
source: {0} must be greater than {1}
pt_br: {0} deve ser maior que {1}

# MustBeLessThan
source: {0} must be less than {1}
pt_br: {0} deve ser menor que {1}

# InvalidRange
source: {0} must be between {1} and {2}
pt_br: {0} deve estar entre {1} e {2}

# Status_Created
source: Status created successfully
pt_br: Status criado com sucesso

# Status_Updated
source: Status updated successfully
pt_br: Status atualizado com sucesso

# Status_Deleted
source: Status deleted successfully
pt_br: Status excluído com sucesso

source: Status not found
pt_br: Status não encontrado

# Status_CreateError
source: Error creating status
pt_br: Erro ao criar status

# Status_UpdateError
source: Error updating status
pt_br: Erro ao atualizar status

# Status_DeleteError
source: Error deleting status
pt_br: Erro ao deletar status

# Status_NameRequired
source: Name is required
pt_br: Nome é obrigatório

# Status_NameMaxLength
source: Name cannot exceed 200 characters
pt_br: Nome não pode ter mais de 200 caracteres

# Status_ScopeRequired
source: Scope is required
pt_br: Escopo é obrigatório

# Status_ScopeMaxLength
source: Scope cannot exceed 100 characters
pt_br: Escopo não pode ter mais de 100 caracteres

# Status_DescriptionMaxLength
source: Description cannot exceed 500 characters
pt_br: Descrição não pode ter mais de 500 caracteres

# Status_IdRequired
source: Id is required
pt_br: Id é obrigatório

# Status_NameDuplicate
source: A status with this name already exists
pt_br: Já existe um status com este nome

# Status_InUse
source: Cannot delete status because it is in use
pt_br: Não é possível excluir o status pois está em uso

source: Status activated
pt_br: Status ativado

source: Status deactivated
pt_br: Status desativado

# Client_Created
source: Client created successfully
pt_br: Cliente criado com sucesso

# Client_Updated
source: Client updated successfully
pt_br: Cliente atualizado com sucesso

# Client_Deleted
source: Client deleted successfully
pt_br: Cliente excluído com sucesso

source: Client not found
pt_br: Cliente não encontrado

# Client_NameRequired
source: Client name is required
pt_br: Nome do cliente é obrigatório

# Client_EmailDuplicate
source: A client with this email already exists
pt_br: Já existe um cliente com este email

# Auth_LoginSuccessful
source: Login successful
pt_br: Login realizado com sucesso

# Auth_InvalidCredentials
source: Invalid email or password
pt_br: Email ou senha inválidos

# Auth_AccountLocked
source: Account is locked. Please try again later
pt_br: Conta bloqueada. Por favor, tente novamente mais tarde

# Auth_EmailNotConfirmed
source: Email not confirmed. Please check your inbox
pt_br: Email não confirmado. Por favor, verifique sua caixa de entrada

# Auth_RegistrationSuccessful
source: Registration successful. Please check your email to confirm your account
pt_br: Cadastro realizado com sucesso. Por favor, verifique seu email para confirmar sua conta

# Auth_EmailConfirmed
source: Email confirmed successfully
pt_br: Email confirmado com sucesso

# Auth_InvalidToken
source: Invalid or expired token
pt_br: Token inválido ou expirado

# Auth_PasswordResetSent
source: Password reset instructions sent to your email
pt_br: Instruções de redefinição de senha enviadas para seu email

# Auth_PasswordResetSuccessful
source: Password reset successfully
pt_br: Senha redefinida com sucesso

# Auth_PasswordChanged
source: Password changed successfully
pt_br: Senha alterada com sucesso

# Auth_InvalidPassword
source: Current password is incorrect
pt_br: Senha atual incorreta

# Auth_WeakPassword
source: Password does not meet security requirements
pt_br: A senha não atende aos requisitos de segurança

# Auth_UserAlreadyExists
source: User with this email already exists
pt_br: Já existe um usuário com este email

# Auth_UserNotFound
source: User not found
pt_br: Usuário não encontrado

# Auth_InvalidData
source: Invalid credentials
pt_br: Dados inválidos

# Auth_EmailNotConfirmedBeforeLogin
source: Confirm your email before logging in
pt_br: Confirme seu e-mail antes de fazer login

# Auth_EmailAlreadyRegistered
source: Email already registered on our platform. If you don't remember your password, use the Forgot Password tool
pt_br: E-mail já cadastrado em nossa plataforma, caso não lembre sua senha utilize a ferramenta de Esqueci minha senha

# Auth_EmailNotConfirmedBeforePasswordRecovery
source: Confirm your email before recovering password
pt_br: Confirme seu e-mail antes de recuperar a senha

# Auth_PasswordRecoveryLinkSent
source: Password recovery link sent to your email
pt_br: Link de recuperação de senha enviado no e-mail

# Auth_InvalidEmailConfirmation
source: Invalid email confirmation
pt_br: Confirmação de Email inválida

# Auth_RefreshTokenInvalid
source: Invalid refresh token
pt_br: Refresh token inválido

# Auth_RefreshTokenExpired
source: Refresh token expired, invalid or revoked
pt_br: Refresh token expirado, inválido ou revogado

# Auth_ExternalAuthFailed
source: Failed to authenticate external user
pt_br: Falha ao autenticar usuário externo

# Auth_ExternalProviderEmailNotFound
source: Could not get email from external provider
pt_br: Não foi possível obter o e-mail do provedor externo

# Auth_OldUserCleanupFailed
source: Failed to clean up old user
pt_br: Falha ao limpar usuário antigo

# Auth_EmailRequired
source: The 'Email' field is required
pt_br: O campo 'E-mail' é obrigatório

# Auth_EmailInvalid
source: Invalid email
pt_br: E-mail inválido

# Auth_PasswordRequired
source: The 'Password' field is required
pt_br: O campo 'Senha' é obrigatório

# Auth_PasswordMinLength
source: Password must be at least 6 characters
pt_br: A senha deve ter no mínimo 6 caracteres

# Auth_ConfirmPasswordRequired
source: The 'Confirm Password' field is required
pt_br: O campo 'Confirmação de senha' é obrigatório

# Auth_PasswordsMismatch
source: Passwords do not match
pt_br: As senhas não coincidem

# Auth_TokenRequired
source: Token is required
pt_br: Token é obrigatório

# Auth_NewPasswordRequired
source: The 'New Password' field is required
pt_br: O campo 'Nova senha' é obrigatório

# Auth_NewPasswordMinLength
source: New password must be at least 6 characters
pt_br: A nova senha deve ter no mínimo 6 caracteres

# Auth_UserIdRequired
source: UserId is required
pt_br: UserId é obrigatório

# Auth_UserIdInvalid
source: Invalid UserId
pt_br: UserId inválido

# Auth_RefreshTokenRequired
source: Refresh token is required
pt_br: Refresh token é obrigatório

# Auth_ProviderRequired
source: Provider is required
pt_br: Provider é obrigatório

# Auth_AuthResultRequired
source: Authentication result is required
pt_br: Resultado de autenticação é obrigatório

# LogError_Created
source: Error logged successfully
pt_br: Erro registrado com sucesso

# LogError_Updated
source: Error log updated successfully
pt_br: Log de erro atualizado com sucesso

# LogError_Deleted
source: Error log deleted successfully
pt_br: Log de erro excluído com sucesso

# LogError_NotFound
source: Error log not found
pt_br: Log de erro não encontrado

# LogError_CreateError
source: Error creating error log
pt_br: Erro ao criar log de erro

# LogError_UpdateError
source: Error updating error log
pt_br: Erro ao atualizar log de erro

# LogError_DeleteError
source: Error deleting error log
pt_br: Erro ao deletar log de erro

# LogError_ErrorRequired
source: Please provide the error
pt_br: Informe o erro

# LogError_IdRequired
source: Please provide the error log ID
pt_br: Informe o ID do log de erro

# Account_UserNotFound
source: User not found
pt_br: Usuário não encontrado

# Account_PasswordChanged
source: Your password has been changed successfully
pt_br: Sua senha foi alterada com sucesso

# Account_CurrentPasswordIncorrect
source: Current password is incorrect
pt_br: A senha atual está incorreta

# Account_NewPasswordMustBeDifferent
source: New password must be different from current password
pt_br: A nova senha deve ser diferente da senha atual

# Account_FullNameRequired
source: Please fill in the name field
pt_br: Preencha o campo de nome

# Account_FullNameMaxLength
source: Name cannot exceed 100 characters
pt_br: O nome deve ter no máximo 100 caracteres

# Account_FullNameMustIncludeFirstAndLastName
source: Please provide first and last name
pt_br: Informe o nome e o sobrenome

# Account_PhoneRequired
source: Please fill in the phone field
pt_br: Preencha o campo de telefone

# Account_PhoneInvalid
source: Phone number must have 10 or 11 digits (area code + number)
pt_br: O telefone deve ter 10 ou 11 dígitos (DDD + número)

# Account_DateOfBirthInvalid
source: Date of birth must be in the past
pt_br: A data de nascimento deve estar no passado

# Account_CpfRequired
source: Please fill in the CPF field
pt_br: Preencha o campo de CPF

# Account_CepRequired
source: The 'ZIP Code' field is required
pt_br: O campo 'CEP' é obrigatório

# Account_CepFormat
source: The 'ZIP Code' field must contain exactly 8 numbers
pt_br: O campo 'CEP' deve conter exatamente 8 números

# Account_StreetRequired
source: The 'Street' field is required
pt_br: O campo 'Endereço' é obrigatório

# Account_StreetMaxLength
source: Street cannot exceed 255 characters
pt_br: O endereço deve ter no máximo 255 caracteres

# Account_NumberRequired
source: The 'Number' field is required
pt_br: O campo 'Número' é obrigatório

# Account_ComplementMaxLength
source: Complement cannot exceed 255 characters
pt_br: O complemento deve ter no máximo 255 caracteres

# Account_NeighborhoodRequired
source: The 'Neighborhood' field is required
pt_br: O campo 'Bairro' é obrigatório

# Account_NeighborhoodMaxLength
source: Neighborhood cannot exceed 100 characters
pt_br: O bairro deve ter no máximo 100 caracteres

# Account_CityRequired
source: The 'City' field is required
pt_br: O campo 'Cidade' é obrigatório

# Account_CityMaxLength
source: City cannot exceed 100 characters
pt_br: A cidade deve ter no máximo 100 caracteres

# Account_StateRequired
source: The 'State' field is required
pt_br: O campo 'Estado' é obrigatório

# Account_StateLength
source: State must have 2 characters
pt_br: O estado deve ter 2 caracteres

# Account_CurrentPasswordRequired
source: The 'Current Password' field is required
pt_br: O campo 'Senha atual' é obrigatório

# Account_NewPasswordRequired
source: The 'New Password' field is required
pt_br: O campo 'Nova senha' é obrigatório

# Account_NewPasswordMinLength
source: New password must be at least 6 characters
pt_br: A nova senha deve ter no mínimo 6 caracteres

# Account_NewPasswordMaxLength
source: New password cannot exceed 100 characters
pt_br: A nova senha deve ter no máximo 100 caracteres

# Account_ConfirmPasswordRequired
source: The 'Confirm Password' field is required
pt_br: O campo 'Confirmação de senha' é obrigatório

# Account_PasswordsDoNotMatch
source: Password confirmation does not match new password
pt_br: A confirmação de senha não coincide com a nova senha

# Pagination_InvalidPageNumber
source: Page number must be greater than 0
pt_br: Número da página deve ser maior que 0

# Pagination_InvalidPageSize
source: Page size must be between 1 and 100
pt_br: Tamanho da página deve estar entre 1 e 100

# Pagination_NoResults
source: No results found
pt_br: Nenhum resultado encontrado

# File_UploadSuccessful
source: File uploaded successfully
pt_br: Arquivo enviado com sucesso

# File_InvalidFormat
source: Invalid file format. Allowed formats: {0}
pt_br: Formato de arquivo inválido. Formatos permitidos: {0}

# File_TooLarge
source: File size exceeds maximum allowed size of {0}MB
pt_br: Tamanho do arquivo excede o máximo permitido de {0}MB

source: File not found
pt_br: Arquivo não encontrado

# Turnstile_ValidationFailed
source: Captcha validation failed. Please try again
pt_br: Validação do captcha falhou. Por favor, tente novamente

# Turnstile_TokenRequired
source: Captcha token is required
pt_br: Token do captcha é obrigatório

# Account_CpfCnpjInvalid
source: CPF or CNPJ must be a valid number
pt_br: CPF ou CNPJ precisam ser um número válido
